{
    "qid": 65,
    "title": "Implement Compressed Row Sparse Matrix (CSR) Format Conversion",
    "qtext": "# Implement Compressed Row Sparse Matrix (CSR) Format Conversion\n\n## Task\n\nConvert a dense matrix into the Compressed Row Sparse (CSR) format, an efficient storage representation for sparse matrices. The CSR format only stores non-zero elements and their positions, significantly reducing memory usage for matrices with a large number of zeros.\n\n## Function Signature\n\n```python\ndef compressed_row_sparse_matrix(dense_matrix: List[List[int]]) -> Tuple[List[int], List[int], List[int]]:\n```\n\n## Description\n\nImplement a function `compressed_row_sparse_matrix(dense_matrix)` that takes a 2D list `dense_matrix` as input and returns a tuple containing three lists:\n\n- **Values array**: A list of all non-zero elements in row-major order.\n- **Column indices array**: The column index for each non-zero element in the values array.\n- **Row pointer array**: The cumulative number of non-zero elements per row, indicating the start of each row in the values array.\n\n## Example 1\n\n**Input:**\n\n```python\ndense_matrix = [\n    [1, 0, 0, 0],\n    [0, 2, 0, 0],\n    [3, 0, 4, 0],\n    [1, 0, 0, 5]\n]\n```\n\n**Output:**\n\n```python\nValues array: [1, 2, 3, 4, 1, 5]\nColumn indices array: [0, 1, 0, 2, 0, 3]\nRow pointer array: [0, 1, 2, 4, 6]\n```\n\n**Explanation:**\n\nThe dense matrix is converted to CSR format with the values array containing non-zero elements, the column indices array storing the corresponding column index, and the row pointer array indicating the start of each row in the values array.\n\n## Constraints\n\n- The input matrix `dense_matrix` is a list of lists where each inner list represents a row of the matrix.\n- The matrix can contain integers.\n- The matrix dimensions are $m \\times n$, where $0 \\leq m, n \\leq 1000$.\n\n## Reasoning\n\nThe dense matrix is converted to CSR format by extracting non-zero elements and their column positions, and tracking row starts for efficient storage and operations.",
    "inputFormat": "dense_matrix: List[List[int]]",
    "outputFormat": "Tuple[List[int], List[int], List[int]]",
    "reason": "The dense matrix is converted to CSR format by extracting non-zero elements and their column positions, and tracking row starts for efficient storage and operations.",
    "learnAbout": "## Compressed Row Storage (CSR) Format\n\nThe Compressed Row Storage (CSR) format is a method of storing sparse matrices that allows for efficient arithmetic operations and memory usage. In CSR format, a sparse matrix is represented using three arrays:\n\n1. **Values array**: This array contains all the non-zero elements of the matrix in row-major order.\n2. **Column indices array**: This array stores the column indices corresponding to each non-zero element in the values array.\n3. **Row pointer array**: This array indicates the starting index of each row in the values array. It has a length of $m + 1$ for an $m \\times n$ matrix, with the last element being the total number of non-zero elements.\n\nCSR format is particularly useful for matrix-vector multiplication and other linear algebra operations, as it minimizes the storage of zero elements and allows for quick access to non-zero elements."
}