{
    "qid": 81,
    "title": "Poisson Distribution Probability Calculator",
    "qtext": "# Poisson Distribution Probability Calculator\n\n## Description\n\nImplement a Python function to calculate the probability of observing exactly $k$ events in a fixed interval using the Poisson distribution formula. The function should take $k$ (the number of events) and $\\lambda$ (the mean rate of occurrences) as inputs and return the probability rounded to 5 decimal places.\n\nThe probability mass function of the Poisson distribution is given by:\n\n$$ P(X = k) = \\frac{e^{-\\lambda} \\lambda^k}{k!} $$\n\nwhere:\n- $k$ is the number of events,\n- $\\lambda$ is the average rate of occurrence,\n- $e$ is the base of the natural logarithm.\n\n## Example 1\n\n**Input:**\n```python\nk = 3, lam = 5\n```\n\n**Output:**\n```python\n0.14037\n```\n\n**Explanation:**\nThe probability of observing exactly 3 events when the average rate is 5 is calculated using the Poisson formula, resulting in approximately 0.14037.\n\n## Constraints\n- $0 \\leq k \\leq 100$\n- $0 < \\lambda \\leq 100$\n- The input values are such that the computed probability can be represented within the precision of a float.\n\n## Reasoning\nThe Poisson distribution models the probability of a given number of events occurring in a fixed interval when these events happen independently and at a constant mean rate.",
    "inputFormat": "```python\nk: int, lam: float\n```",
    "outputFormat": "```python\nfloat\n```",
    "reason": "The Poisson distribution models the probability of a given number of events happening in a fixed interval when the events occur independently at a constant mean rate.",
    "learnAbout": "## Poisson Distribution\n\nThe Poisson distribution is a discrete probability distribution that expresses the probability of a given number of events occurring in a fixed interval of time or space. These events must occur with a known constant mean rate and independently of the time since the last event. The Poisson distribution is often used in scenarios where events occur randomly and independently, such as the number of emails received in an hour or the number of decay events per unit time from a radioactive source.\n\nMathematically, the Poisson distribution is characterized by its parameter $\\lambda$, which is both the mean and the variance of the distribution. The probability of observing exactly $k$ events is given by the formula:\n\n$$ P(X = k) = \\frac{e^{-\\lambda} \\lambda^k}{k!} $$\n\nwhere $e$ is the base of the natural logarithm, approximately equal to 2.71828. The Poisson distribution is particularly useful in fields such as telecommunications, astronomy, and traffic engineering."
}