{
    "qid": 48,
    "title": "Implement Reduced Row Echelon Form (RREF) Function",
    "qtext": "In this problem, your task is to implement a function that converts a given matrix into its Reduced Row Echelon Form (RREF). The RREF of a matrix is a special form where each leading entry in a row is 1, and all other elements in the column containing the leading 1 are zeros, except for the leading 1 itself.\n\nHowever, there are some additional details to keep in mind:\n\n- Diagonal entries can be 0 if the matrix is reducible (i.e., the row corresponding to that position can be eliminated entirely).\n- Some rows may consist entirely of zeros.\n- If a column contains a pivot (a leading 1), all other entries in that column should be zero.\n\nYour task is to implement the RREF algorithm, which must handle these cases and convert any given matrix into its RREF.\n\nExample:\n\nInput:\n```python\nimport numpy as np\n\nmatrix = np.array([\n    [1, 2, -1, -4],\n    [2, 3, -1, -11],\n    [-2, 0, -3, 22]\n])\n\nrref_matrix = rref(matrix)\nprint(rref_matrix)\n```\n\nOutput:\n```python\n# array([\n#    [ 1.  0.  0. -8.],\n#    [ 0.  1.  0.  1.],\n#    [-0. -0.  1. -2.]\n# ])\n```\n\nReasoning:\nThe given matrix is converted to its Reduced Row Echelon Form (RREF) where each leading entry is 1, and all other entries in the leading columns are zero.",
    "inputFormat": "One input:\n- `matrix` (NumPy array): A 2D NumPy array representing the input matrix to be reduced.",
    "outputFormat": "A NumPy array representing the matrix converted to its Reduced Row Echelon Form (RREF).",
    "reason": "The RREF form simplifies solving systems of linear equations and understanding the fundamental properties of a matrix, such as its rank.",
    "learnAbout": "Understanding the RREF Algorithm\n\nThe Reduced Row Echelon Form (RREF) of a matrix is a specific form achieved through a sequence of elementary row operations. This algorithm will convert any matrix into its RREF, which is useful for solving linear equations and understanding the properties of the matrix.\n\nHere’s a step-by-step guide to implementing the RREF algorithm:\n\n1. **Start with the leftmost column**:\n   Set the initial leading column to the first column of the matrix. Move this \"lead\" to the right as you progress through the algorithm.\n\n2. **Select the pivot row**:\n   Identify the first non-zero entry in the current leading column. This entry is the pivot. If necessary, swap rows to bring the pivot into position to avoid having a zero in the pivot position.\n\n3. **Scale the pivot row**:\n   Divide the entire pivot row by the pivot value to make the leading entry equal to 1.\n\n$$\n\\text{Row}_r = \\frac{\\text{Row}_r}{\\text{pivot}}\n$$\n\nFor example, if the pivot is 3, divide the entire row by 3 to make the leading entry 1.\n\n4. **Eliminate above and below the pivot**:\n   Subtract multiples of the pivot row from all the other rows to create zeros in the rest of the pivot column. This ensures the pivot is the only non-zero entry in its column.\n\n$$\n\\text{Row}_i = \\text{Row}_i - (\\text{Row}_r \\times \\text{lead coefficient})\n$$\n\nRepeat this step for each row \\( i \\) where \\( i \\neq r \\), ensuring all entries above and below the pivot are zero.\n\n5. **Move to the next column**:\n   Move the lead one column to the right and repeat the process from step 2. Continue until there are no more columns to process or the remaining submatrix is all zeros.\n\nBy following these steps, the matrix will be converted into its Reduced Row Echelon Form, where each leading entry is 1, and all other entries in the leading columns are zero."
  }  