{
    "qid": 63,
    "title": "Implement the Conjugate Gradient Method for Solving Linear Systems",
    "qtext": "# Implement the Conjugate Gradient Method for Solving Linear Systems\n\n## Task\nImplement the Conjugate Gradient (CG) method, an efficient iterative algorithm for solving large, sparse, symmetric, positive-definite linear systems. Given a matrix $A$ and a vector $b$, the algorithm will solve for $x$ in the system $Ax = b$.\n\n## Function Signature\n```python\ndef conjugate_gradient(A, b, n, x0=None, tol=1e-8):\n```\n\n## Parameters\n- **A**: A symmetric, positive-definite matrix representing the linear system.\n- **b**: The vector on the right side of the equation.\n- **n**: Maximum number of iterations.\n- **x0**: Initial guess for the solution vector (default is the zero vector).\n- **tol**: Tolerance for stopping criteria (default is $1 \\times 10^{-8}$).\n\n## Returns\n- The solution vector $x$ as a 1D NumPy array.\n\n## Example 1\n**Input:**\n```python\nA = np.array([[4, 1], [1, 3]])\nb = np.array([1, 2])\nn = 5\n```\n**Output:**\n```python\n[0.09090909, 0.63636364]\n```\n**Explanation:**\nThe Conjugate Gradient method is applied to the linear system $Ax = b$ with the given matrix $A$ and vector $b$. The algorithm iteratively refines the solution to converge to the exact solution.\n\n## Constraints\n- $A$ is a symmetric, positive-definite matrix.\n- $b$ is a 1D NumPy array.\n- $n$ is a positive integer.\n- If provided, $x0$ is a 1D NumPy array of the same length as $b$.\n- $tol$ is a positive float.\n\n## Notes\nThe Conjugate Gradient method is efficient for solving symmetric positive-definite systems, providing faster convergence compared to methods like steepest descent by ensuring search directions are $A$-orthogonal.",
    "inputFormat": "```python\nA = np.array([[4, 1], [1, 3]])\nb = np.array([1, 2])\nn = 5\n```",
    "outputFormat": "```python\n[0.09090909, 0.63636364]\n```",
    "reason": "The Conjugate Gradient method is efficient for solving symmetric positive-definite systems, providing faster convergence compared to methods like steepest descent by ensuring search directions are A-orthogonal.",
    "learnAbout": "## Learning: Conjugate Gradient Method\nThe Conjugate Gradient (CG) method is an iterative algorithm for solving systems of linear equations where the coefficient matrix is symmetric and positive-definite. It is particularly useful for large, sparse systems where direct methods like Gaussian elimination are computationally expensive. The CG method works by iteratively refining an initial guess to converge towards the true solution. It does so by ensuring that each search direction is conjugate with respect to the matrix $A$, leading to faster convergence compared to gradient descent methods. The method is based on minimizing the quadratic form associated with the linear system, and it guarantees convergence in at most $n$ iterations for an $n \\times n$ matrix, assuming exact arithmetic."
}