{
    "qid": 111,
    "title": "Descriptive Statistics Calculator",
    "qtext": "Write a Python function to calculate various descriptive statistics metrics for a given dataset. The function should take a list or NumPy array of numerical values and return a dictionary containing mean, median, mode, variance, standard deviation, percentiles (25th, 50th, 75th), and interquartile range (IQR).\n\nExample:\nInput:\n```python\n[10, 20, 30, 40, 50]\n```\nOutput:\n```python\n{'mean': 30.0, 'median': 30.0, 'mode': 10, 'variance': 200.0, 'standard_deviation': 14.142135623730951, '25th_percentile': 20.0, '50th_percentile': 30.0, '75th_percentile': 40.0, 'interquartile_range': 20.0}\n```\n\nReasoning:\nThe dataset is processed to calculate all descriptive statistics. The mean is the average value, the median is the central value, the mode is the most frequent value, and variance and standard deviation measure the spread of data. Percentiles and IQR describe data distribution.",
    "inputFormat": "One input:\n- A list or NumPy array of numerical values.",
    "outputFormat": "One output:\n- A dictionary containing mean, median, mode, variance, standard deviation, 25th percentile, 50th percentile, 75th percentile, and interquartile range.",
    "reason": "Descriptive statistics provide a summary of the data, allowing for a deeper understanding of its structure, central tendency, variability, and distribution, which are crucial for exploratory data analysis and model preparation.",
    "learnAbout": "Understanding Descriptive Statistics\n\nDescriptive statistics summarize and organize characteristics of a data set through various metrics.\n\n**Key Metrics:**\n- **Mean**: The average of the data.\n- **Median**: The middle value when the data is ordered.\n- **Mode**: The most frequent value in the data.\n- **Variance**: The average of squared differences from the mean.\n- **Standard Deviation**: The square root of variance, measuring data spread.\n- **Percentiles**: Values below which a given percentage of observations fall.\n- **Interquartile Range (IQR)**: The range between the 75th and 25th percentiles, showing data dispersion.\n\n**Applications:**\nDescriptive statistics are foundational in data science, feature engineering, exploratory data analysis (EDA), identifying outliers, and preparing data for machine learning models."
  }
  