{
    "qid": 111,
    "title": "Descriptive Statistics Calculator",
    "qtext": "# Descriptive Statistics Calculator\n\n## Description\n\nWrite a Python function to calculate various descriptive statistics for a given dataset. The function should accept a list or NumPy array of numerical values and return a dictionary containing the following metrics:\n\n- **Mean**: The average of the dataset, calculated as $\\text{mean} = \\frac{1}{n} \\sum_{i=1}^{n} x_i$.\n- **Median**: The middle value of the dataset when sorted.\n- **Mode**: The most frequently occurring value in the dataset.\n- **Variance**: The measure of data spread, calculated as $\\text{variance} = \\frac{1}{n} \\sum_{i=1}^{n} (x_i - \\text{mean})^2$.\n- **Standard Deviation**: The square root of the variance, representing data dispersion.\n- **Percentiles**: The 25th, 50th, and 75th percentiles, indicating the value below which a given percentage of observations fall.\n- **Interquartile Range (IQR)**: The difference between the 75th and 25th percentiles, representing the middle 50% of the data.\n\n## Example 1\n\n**Input:**\n```python\n[10, 20, 30, 40, 50]\n```\n\n**Output:**\n```python\n{\n  'mean': 30.0,\n  'median': 30.0,\n  'mode': 10,\n  'variance': 200.0,\n  'standard_deviation': 14.142135623730951,\n  '25th_percentile': 20.0,\n  '50th_percentile': 30.0,\n  '75th_percentile': 40.0,\n  'interquartile_range': 20.0\n}\n```\n\n**Explanation:**\nThe dataset is processed to calculate all descriptive statistics. The mean is the average value, the median is the central value, the mode is the most frequent value, and variance and standard deviation measure the spread of data. Percentiles and IQR describe data distribution.\n\n## Constraints\n\n- The input is a list or NumPy array of numerical values.\n- The dataset contains at least one element.\n- The mode is defined as the smallest value in case of multiple modes.\n\n## Learning\n\nDescriptive statistics provide a summary of a dataset, offering insights into its central tendency, variability, and distribution. The **mean** is the arithmetic average, providing a measure of central location. The **median** offers a robust measure of central tendency, especially useful in skewed distributions. The **mode** identifies the most common value. **Variance** and **standard deviation** quantify the spread of data, with standard deviation being particularly useful due to its units matching those of the data. **Percentiles** and the **interquartile range (IQR)** help understand the distribution and spread of the data, highlighting the range within which the central portion of data lies.\n",
    "inputFormat": "```python\nlist or np.array\n```",
    "outputFormat": "```python\ndict\n```",
    "reason": "Descriptive statistics provide a summary of the data, allowing for a deeper understanding of its structure, central tendency, variability, and distribution, which are crucial for exploratory data analysis and model preparation.",
    "learnAbout": "Descriptive statistics are crucial in data analysis, providing a summary of the data's central tendency, dispersion, and distribution. The **mean** is calculated as the sum of all data points divided by the number of points, offering a central value. The **median** is the middle value when data is sorted, providing a robust measure of central tendency. The **mode** is the most frequently occurring value. **Variance** quantifies the average squared deviation from the mean, and the **standard deviation** is its square root, indicating how much the data deviates from the mean. **Percentiles** divide the data into 100 equal parts, and the **interquartile range (IQR)**, the difference between the 75th and 25th percentiles, measures the spread of the middle 50% of data."
}