{
    "qid": 6,
    "title": "Calculate Eigenvalues of a Matrix",
    "qtext": "# Calculate Eigenvalues of a 2x2 Matrix\n\n## Description\n\nWrite a Python function to calculate the eigenvalues of a given 2x2 matrix. The function should return a list containing the eigenvalues, sorted in descending order.\n\nThe eigenvalues of a 2x2 matrix \\( A \\) can be found using the characteristic equation:\n\n$$\n\\lambda^2 - \\text{trace}(A) \\cdot \\lambda + \\det(A) = 0\n$$\n\nwhere \\( \\lambda \\) represents the eigenvalues, \\( \\text{trace}(A) \\) is the sum of the diagonal elements of the matrix, and \\( \\det(A) \\) is the determinant of the matrix.\n\n## Example 1\n\n**Input:**\n```python\nmatrix = [[2, 1], [1, 2]]\n```\n\n**Output:**\n```python\n[3.0, 1.0]\n```\n\n**Explanation:**\nThe characteristic equation for the matrix is:\n$$\n\\lambda^2 - 4\\lambda + 3 = 0\n$$\nSolving this quadratic equation gives the eigenvalues \\( \\lambda_1 = 3.0 \\) and \\( \\lambda_2 = 1.0 \\).\n\n## Constraints\n- The input matrix is always a 2x2 matrix.\n- Matrix elements are real numbers.\n- The input matrix is represented as a list of lists in Python.\n\n## Input Format\n```python\nmatrix: List[List[float]]\n```\n\n## Output Format\n```python\nList[float]\n```\n\nThe output is a list of two floats representing the eigenvalues, sorted from highest to lowest.",
    "inputFormat": "```python\nmatrix: List[List[float]]\n```",
    "outputFormat": "```python\nList[float]\n```",
    "reason": "The eigenvalues provide critical insight into matrix behavior, used for analyzing stability, transformations, and machine learning applications like PCA.",
    "learnAbout": "## Learning: Eigenvalues\n\nEigenvalues are a fundamental concept in linear algebra, representing the factors by which the eigenvectors of a matrix are scaled during a linear transformation. For a square matrix \\( A \\), an eigenvalue \\( \\lambda \\) satisfies the equation \\( A\\mathbf{v} = \\lambda\\mathbf{v} \\), where \\( \\mathbf{v} \\) is a non-zero vector known as an eigenvector. The eigenvalues provide insights into the properties of the matrix, such as stability and oscillatory behavior, and are widely used in applications like Principal Component Analysis (PCA) in machine learning, where they help in dimensionality reduction by identifying the directions of maximum variance in the data."
}