{
    "qid": 11,
    "title": "Solve Linear Equations using Jacobi Method",
    "qtext": "# Solve Linear Equations using the Jacobi Method\n\n## Problem Description\n\nImplement a Python function that employs the Jacobi method to approximate the solution of a system of linear equations represented by $Ax = b$. The function should iterate a specified number of times, $n$, and return the approximate solution vector $x$, with each component rounded to four decimal places.\n\nThe Jacobi method is an iterative algorithm that updates the solution vector $x$ by solving each equation for $x[i]$ using the formula:\n\n$$\nx[i] = \\frac{1}{a_{ii}} \\left( b[i] - \\sum_{j \\neq i} a_{ij}x[j] \\right)\n$$\n\nwhere $a_{ii}$ is the diagonal element of the matrix $A$, and $a_{ij}$ are the off-diagonal elements.\n\n## Example 1\n\n**Input:**\n```python\nA = [[5, -2, 3], [-3, 9, 1], [2, -1, -7]]\nb = [-1, 2, 3]\nn = 2\n```\n\n**Output:**\n```python\n[0.146, 0.2032, -0.5175]\n```\n\n**Explanation:**\nAfter two iterations of the Jacobi method, the approximate solution vector $x$ is $[0.146, 0.2032, -0.5175]$, with each component rounded to four decimal places.\n\n## Constraints\n- The matrix $A$ is a square matrix of size $m \\times m$.\n- The vector $b$ is of length $m$.\n- The number of iterations $n$ is a positive integer.\n- The diagonal elements of $A$ are non-zero.\n\n## Input Format\n```python\nA: List[List[float]]\nb: List[float]\nn: int\n```\n\n## Output Format\n```python\nList[float]\n```",
    "inputFormat": "```python\nA: List[List[float]]\nb: List[float]\nn: int\n```",
    "outputFormat": "```python\nList[float]\n```",
    "reason": "The Jacobi method provides an iterative approach to solving linear systems, especially useful when direct methods are computationally too expensive for large matrices.",
    "learnAbout": "## Learning: The Jacobi Method\n\nThe Jacobi method is an iterative algorithm used to solve a system of linear equations. It is particularly useful for large systems where direct methods like Gaussian elimination are computationally expensive. The method assumes an initial guess for the solution and iteratively refines this guess. In each iteration, the value of each variable is updated based on the values from the previous iteration. The method converges to the true solution if the matrix $A$ is diagonally dominant or symmetric positive definite. The precision of the solution improves with more iterations, making it a flexible approach for approximate solutions."
}