{
    "qid": 28,
    "title": "SVD of a 2×2 Matrix using eigen values & vectors",
    "qtext": "Given a 2×2 matrix, write a Python function to compute its Singular Value Decomposition (SVD). The function should return the matrices U, S, and V such that A = U * S * V, use the method described in this post: https://metamerist.blogspot.com/2006/10/linear-algebra-for-graphics-geeks-svd.html\n\nExample:\n\nInput:\n```python\nA = [[-10, 8],\n     [10, -1]]\n```\n\nOutput:\n```python\n(array([[ 0.8, -0.6],\n        [-0.6, -0.8]]),\n array([15.65247584, 4.47213595]),\n array([[-0.89442719, 0.4472136],\n        [-0.4472136, -0.89442719]]))\n```\n\nReasoning:\nThe SVD of the matrix A is calculated using the eigenvalues and eigenvectors of AᵀA and AAᵀ. The singular values are the square roots of the eigenvalues, and the eigenvectors form the columns of matrices U and V.",
    "inputFormat": "One input:\n- `A` (list of lists): A 2×2 matrix to perform Singular Value Decomposition on.",
    "outputFormat": "A tuple containing:\n- A 2x2 array (U matrix)\n- A 1D array (Singular values)\n- A 2x2 array (V matrix)",
    "reason": "The SVD of the matrix is calculated using the eigenvalues and eigenvectors of AᵀA and AAᵀ. The singular values are the square roots of the eigenvalues, and the eigenvectors form the columns of matrices U and V.",
    "learnAbout": "Understanding Singular Value Decomposition (SVD)\n\nSingular Value Decomposition (SVD) is a method in linear algebra for decomposing a matrix into three other matrices. For a given matrix \\( A \\), SVD is represented as:\n\n$$\nA = U \\cdot S \\cdot V^T\n$$\n\n**Step-by-Step Method to Calculate the SVD of a 2×2 Matrix by Hand:**\n\n1. **Calculate (AᵀA) and (AAᵀ):**\n   Compute the product of the matrix with its transpose and the transpose of the matrix with itself. These matrices share the same eigenvalues.\n\n2. **Find the Eigenvalues:**\n   To find the eigenvalues of a 2×2 matrix, solve the characteristic equation:\n   \n   $$\n   \\det(A - \\lambda I) = 0\n   $$\n   \n   This results in a quadratic equation.\n\n3. **Compute the Singular Values:**\n   The singular values, which form the diagonal elements of the matrix \\( S \\), are the square roots of the eigenvalues.\n\n4. **Calculate the Eigenvectors:**\n   For each eigenvalue, solve the equation:\n   \n   $$\n   (A - \\lambda I)x = 0\n   $$\n   \n   to find the corresponding eigenvector. Normalize these eigenvectors to form the columns of \\( U \\) and \\( V \\).\n\n5. **Form the Matrices (U), (S), and (V):**\n   Combine the singular values and eigenvectors to construct the matrices \\( U \\), \\( S \\), and \\( V \\) such that:\n\n   $$\n   A = U \\cdot S \\cdot V^T\n   $$\n\n**Additional Notes:**\n- This method involves solving quadratic equations to find eigenvalues and eigenvectors and normalizing these vectors to unit length.\n\n**Resources:**\n- *Linear Algebra for Graphics Geeks (SVD-IX) by METAMERIST* [Google Search]\n- *Robust Algorithm for 2×2 SVD*\n\nThis explanation provides a clear and structured overview of how to calculate the SVD of a 2×2 matrix by hand."
  }  