{
    "qid": 95,
    "title": "Calculate the Phi Coefficient",
    "qtext": "# Calculate the Phi Coefficient\n\n## Description\nImplement a function to calculate the Phi coefficient, which is a measure of the correlation between two binary variables. The function should take two lists of integers, each containing only 0s and 1s, as input and return the Phi coefficient rounded to four decimal places.\n\nThe Phi coefficient is defined as:\n\n$$ \\phi = \\frac{n_{11}n_{00} - n_{10}n_{01}}{\\sqrt{(n_{1\\cdot}n_{0\\cdot}n_{\\cdot1}n_{\\cdot0})}} $$\n\nwhere:\n- $n_{11}$ is the number of times both variables are 1.\n- $n_{00}$ is the number of times both variables are 0.\n- $n_{10}$ is the number of times the first variable is 1 and the second is 0.\n- $n_{01}$ is the number of times the first variable is 0 and the second is 1.\n- $n_{1\\cdot}$, $n_{0\\cdot}$, $n_{\\cdot1}$, $n_{\\cdot0}$ are the sums of the respective rows and columns in the contingency table.\n\n## Example 1\n\n**Input:**\n```python\nphi_corr([1, 1, 0, 0], [0, 0, 1, 1])\n```\n\n**Output:**\n```python\n-1.0\n```\n\n**Explanation:**\nThe two binary variables have a perfect negative correlation, resulting in a Phi coefficient of -1.0.\n\n## Constraints\n- The input lists must have the same length.\n- Each list contains only integers 0 and 1.\n- The length of the lists is at least 2 and at most $10^5$.\n\n## Learning\nThe Phi coefficient is a statistical measure used to evaluate the strength and direction of association between two binary variables. It is similar to the Pearson correlation coefficient but specifically designed for binary data. The Phi coefficient ranges from -1 to 1, where -1 indicates a perfect negative correlation, 1 indicates a perfect positive correlation, and 0 indicates no correlation. It is particularly useful in fields like data science and machine learning for understanding relationships in categorical data.\n",
    "inputFormat": "```python\nphi_corr(list1: List[int], list2: List[int]) -> float\n```",
    "outputFormat": "```python\nfloat\n```",
    "reason": "The Phi coefficient helps understand the degree of association between two binary variables. It ranges from -1 (perfect negative correlation) to 1 (perfect positive correlation), with 0 indicating no correlation.",
    "learnAbout": "The Phi coefficient is a measure of association for two binary variables, akin to the Pearson correlation coefficient but adapted for binary data. It is calculated using the contingency table of the two variables, which records the frequency of each combination of outcomes. The formula for the Phi coefficient is derived from the chi-squared statistic for a 2x2 table, making it a valuable tool for understanding binary associations in statistics and data science. The Phi coefficient is symmetric, meaning the correlation between variable A and B is the same as between B and A, and it is invariant to the coding of the binary variables (i.e., swapping 0s and 1s will not affect the magnitude of the coefficient)."
}