{
    "qid": 84,
    "title": "Phi Transformation for Polynomial Features",
    "qtext": "# Phi Transformation for Polynomial Features\n\n## Description\n\nImplement a Python function to perform a Phi Transformation that maps input features into a higher-dimensional space by generating polynomial features. This transformation allows models, such as linear regression, to fit nonlinear data by introducing new feature dimensions that represent polynomial combinations of the original input features. The function should take a list of numerical data and a degree as inputs, and return a nested list where each inner list represents the transformed features of a data point. If the degree is less than 0, the function should return an empty list.\n\n## Example 1\n\n- **Input:**\n  \n  ```python\n  data = [1.0, 2.0]\n  degree = 2\n  ```\n\n- **Output:**\n  \n  ```python\n  [[1.0, 1.0, 1.0], [1.0, 2.0, 4.0]]\n  ```\n\n- **Explanation:**\n  \n  The Phi Transformation generates polynomial features for each data point up to the specified degree. For `data = [1.0, 2.0]` and `degree = 2`, the transformation creates a nested list where each row contains powers of the data point from 0 to 2.\n\n## Constraints\n\n- The input list `data` contains floats or integers.\n- The `degree` is an integer.\n- If `degree < 0`, return an empty list.\n- The length of `data` is between 1 and 100.\n- Each element in `data` is between $-10^3$ and $10^3$.\n\n## Mathematical Formulation\n\nFor each data point $x_i$ in the input list `data`, the transformation generates a list of polynomial features $[x_i^0, x_i^1, \\, \\ldots, \\, x_i^{d}]$, where $d$ is the specified degree.",
    "inputFormat": "```python\ndata: List[float]\ndegree: int\n```",
    "outputFormat": "```python\nList[List[float]]\n```",
    "reason": "The Phi Transformation generates polynomial features from data points, enabling models to better capture nonlinear relationships by introducing polynomial feature expansions.",
    "learnAbout": "## Learning\n\nThe Phi Transformation is a technique used to enhance the feature set of a dataset by generating polynomial features. This is particularly useful in linear models, such as linear regression, to capture nonlinear relationships within the data. By transforming the input features into polynomial terms, the model can fit more complex patterns. For instance, a linear regression model can only capture linear relationships, but by adding polynomial features, it can approximate nonlinear functions. The transformation is defined as generating all powers of each feature up to a specified degree, which can be mathematically represented as $[x^0, x^1, \\ldots, x^d]$ for a feature $x$ and degree $d$."
}