{
    "qid": 51,
    "title": "Optimal String Alignment Distance",
    "qtext": "# Optimal String Alignment Distance\n\nIn this problem, you are required to implement a function that calculates the **Optimal String Alignment (OSA) distance** between two given strings. The OSA distance is defined as the minimum number of edit operations needed to transform one string into another. The allowed edit operations are:\n\n- **Insert** a character\n- **Delete** a character\n- **Substitute** a character\n- **Transpose** two adjacent characters\n\nEach of these operations has a cost of 1 unit.\n\nYour task is to determine the minimum number of edits required to convert the first string $s_1$ into the second string $s_2$.\n\n## Example 1\n\n**Input:**\n\n```plaintext\nsource = \"butterfly\"\ntarget = \"dragonfly\"\n```\n\n**Output:**\n\n```plaintext\n6\n```\n\n**Explanation:**\n\nThe OSA distance between the strings \"butterfly\" and \"dragonfly\" is 6. The minimum number of edits required to transform the source string into the target string is 6.\n\n## Constraints\n\n- $1 \\leq |s_1|, |s_2| \\leq 1000$\n- The strings $s_1$ and $s_2$ consist of lowercase English letters only.\n\n",
    "inputFormat": "source = \"butterfly\", target = \"dragonfly\"",
    "outputFormat": "6",
    "reason": "The OSA distance between the strings \"butterfly\" and \"dragonfly\" is 6. The minimum number of edits required to transform the source string into the target string is 6.",
    "learnAbout": "The **Optimal String Alignment (OSA) distance** is a variation of the edit distance problem, which measures how dissimilar two strings are by counting the minimum number of operations required to transform one string into another. The OSA distance allows for four types of operations: insertion, deletion, substitution, and transposition of adjacent characters. This makes it more flexible than the traditional Levenshtein distance, which only allows insertion, deletion, and substitution. The transposition operation is particularly useful in applications where adjacent character swaps are common, such as in typographical errors."
}