{
    "qid": 86,
    "title": "Detect Overfitting or Underfitting",
    "qtext": "## Detect Overfitting or Underfitting\n\n### Problem Description\n\nWrite a Python function to determine whether a machine learning model is overfitting, underfitting, or performing well based on training and test accuracy values. The function should take two inputs: `training_accuracy` and `test_accuracy`. It should return one of three values:\n\n- `1` if the model is **Overfitting**.\n- `-1` if the model is **Underfitting**.\n- `0` if the model has a **Good fit**.\n\n### Criteria for Determination\n\n- **Overfitting**: The training accuracy is significantly higher than the test accuracy, specifically when the difference is greater than $0.2$.\n- **Underfitting**: Both training and test accuracy are below $0.7$.\n- **Good fit**: Neither of the above conditions is true.\n\n### Constraints\n\n- $0 \\leq \\text{training\\_accuracy} \\leq 1$\n- $0 \\leq \\text{test\\_accuracy} \\leq 1$\n- Inputs are floating-point numbers.\n\n### Example 1\n\n**Input:**\n```python\ntraining_accuracy = 0.95\ntest_accuracy = 0.65\n```\n\n**Output:**\n```python\n1\n```\n\n**Explanation:** The training accuracy is much higher than the test accuracy (difference = $0.30 > 0.2$). This indicates that the model is overfitting to the training data and generalizes poorly to unseen data.",
    "inputFormat": "```python\ntraining_accuracy = 0.95\ntest_accuracy = 0.65\n```",
    "outputFormat": "```python\n1\n```",
    "reason": "The training accuracy is much higher than the test accuracy (difference = 0.30 > 0.2). This indicates that the model is overfitting to the training data and generalizes poorly to unseen data.",
    "learnAbout": "### Understanding Overfitting and Underfitting\n\nIn machine learning, **overfitting** occurs when a model learns the training data too well, capturing noise and fluctuations that do not generalize to new data. This often results in high training accuracy but low test accuracy. Mathematically, if the difference between training and test accuracy is significant, the model is likely overfitting.\n\nOn the other hand, **underfitting** happens when a model is too simple to capture the underlying patterns in the data, resulting in both low training and test accuracy. This indicates that the model is not complex enough to learn from the data. A good model should balance these two extremes, achieving high accuracy on both training and test datasets."
}