{
    "qid": 52,
    "title": "Implement Recall Metric in Binary Classification",
    "qtext": "Task: Implement Recall in Binary Classification\n\nYour task is to implement the recall metric in a binary classification setting. Recall is a performance measure that evaluates how effectively a machine learning model identifies positive instances from all the actual positive cases in a dataset.\n\nYou need to write a function recall(y_true, y_pred) that calculates the recall metric. The function should accept two inputs:\n\ny_true: A list of true binary labels (0 or 1) for the dataset.\ny_pred: A list of predicted binary labels (0 or 1) from the model.\n\nYour function should return the recall value rounded to three decimal places. If the denominator (TP + FN) is zero, the recall should be 0.0 to avoid division by zero.\n\nExample:\nInput:\nimport numpy as np\n\ny_true = np.array([1, 0, 1, 1, 0, 1])\ny_pred = np.array([1, 0, 1, 0, 0, 1])\n\nprint(recall(y_true, y_pred))\nOutput:\n# 0.75\n\nReasoning:\nThe recall value for the given true labels and predicted labels is 0.75. The model correctly identified 3 out of 4 positive instances in the dataset.",
    "inputFormat": "import numpy as np\n\ny_true = np.array([1, 0, 1, 1, 0, 1])\ny_pred = np.array([1, 0, 1, 0, 0, 1])",
    "outputFormat": "# 0.75",
    "reason": "The recall value for the given true labels and predicted labels is 0.75. The model correctly identified 3 out of 4 positive instances in the dataset.",
    "learnAbout": "Understanding Recall in Classification\n\nRecall is a metric that measures how often a machine learning model correctly identifies positive instances, also known as true positives, from all the actual positive samples in the dataset.\n\n**Mathematical Definition**\n\nRecall, also known as sensitivity, is the fraction of relevant instances that were retrieved. It is calculated using the following equation:\n\n$$\n\\text{Recall} = \\frac{TP}{TP + FN}\n$$\n\nWhere:\n\n- True Positives (TP): The number of positive samples that are correctly identified as positive.\n- False Negatives (FN): The number of positive samples that are incorrectly identified as negative.\n\n**Task**\n\nIn this problem, you will implement a function to calculate recall given the true labels and predicted labels of a binary classification task. The results should be rounded to three decimal places."
  }  