{
    "qid": 52,
    "title": "Implement Recall Metric in Binary Classification",
    "qtext": "## Implement Recall Metric in Binary Classification\n\n### Task\n\nImplement the recall metric for a binary classification problem. Recall is a performance measure that evaluates how effectively a machine learning model identifies positive instances from all the actual positive cases in a dataset.\n\n### Definition\n\nThe recall metric, also known as sensitivity or true positive rate, is defined as:\n\n$$\n\\text{Recall} = \\frac{TP}{TP + FN}\n$$\n\nwhere:\n- $TP$ (True Positives) is the number of correctly predicted positive instances.\n- $FN$ (False Negatives) is the number of actual positive instances that were incorrectly predicted as negative.\n\n### Function Signature\n\n```python\ndef recall(y_true, y_pred):\n```\n\n### Parameters\n- `y_true`: A numpy array of true binary labels (0 or 1) for the dataset.\n- `y_pred`: A numpy array of predicted binary labels (0 or 1) from the model.\n\n### Returns\n- A float representing the recall value, rounded to three decimal places. If the denominator $(TP + FN)$ is zero, the function should return 0.0 to avoid division by zero.\n\n### Constraints\n- The input arrays `y_true` and `y_pred` have the same length.\n- Each element in `y_true` and `y_pred` is either 0 or 1.\n\n### Example 1\n\n**Input:**\n```python\nimport numpy as np\n\ny_true = np.array([1, 0, 1, 1, 0, 1])\ny_pred = np.array([1, 0, 1, 0, 0, 1])\n```\n\n**Output:**\n```python\n0.75\n```\n\n**Explanation:**\nThe model correctly identified 3 out of 4 positive instances in the dataset, resulting in a recall of $\\frac{3}{4} = 0.75$.",
    "inputFormat": "```python\nimport numpy as np\n\ny_true = np.array([...])\ny_pred = np.array([...])\n```",
    "outputFormat": "```python\n0.75\n```",
    "reason": "The recall value for the given true labels and predicted labels is 0.75. The model correctly identified 3 out of 4 positive instances in the dataset.",
    "learnAbout": "### Understanding Recall in Binary Classification\n\nRecall, also known as sensitivity or the true positive rate, is a crucial metric in binary classification tasks, especially when the cost of false negatives is high. It measures the ability of a model to capture all relevant instances of the positive class. Mathematically, recall is the ratio of true positives (correctly predicted positive instances) to the sum of true positives and false negatives (actual positive instances that were not predicted as positive). A high recall indicates that the model is effective at identifying positive cases, which is particularly important in applications such as medical diagnosis, where missing a positive case (e.g., a disease) can have serious consequences."
}